TODO: 

* setup streams using python snowflake connector

In [1]:
import snowflake.connector
import os

/Users/jordanpacho/Desktop/Sigma_Labs/Coursework/Deloton-Exercise-Bikes/.venv/lib/python3.9/site-packages/snowflake/connector/options.py:96: UserWarning: You have an incompatible version of 'pyarrow' installed (9.0.0), please install a version that adheres to: 'pyarrow<8.1.0,>=8.0.0; extra == "pandas"'
  warn_incompatible_dep(

In [2]:
USER = os.environ.get('USER')
ACCOUNT = os.environ.get('ACCOUNT')
PASSWORD = os.environ.get('PASSWORD')
WAREHOUSE= os.environ.get('WAREHOUSE')
DATABASE= os.environ.get('DATABASE')
BATCH_SCHEMA= os.environ.get('BATCH_SCHEMA')

In [3]:
conn = snowflake.connector.connect(
    user=USER,
    password=PASSWORD,
    account=ACCOUNT,
    warehouse=WAREHOUSE,
    database=DATABASE,
    schema=BATCH_SCHEMA
)
cs = conn.cursor()

#### Making table streams

In [4]:
query = """
    CREATE STREAM rides_stream
    ON TABLE rides
"""
# cs.execute(query)

In [19]:
query_stream = """
    SELECT *
    FROM rides_stream
"""

cs.execute(query_stream).fetch_pandas_all()

,RIDE_ID,USER_ID,BEGIN_TIMESTAMP,TOTAL_DURATION_SEC,TOTAL_POWER,MEAN_POWER,MEAN_RESISTANCE,MEAN_RPM,MEAN_HEART_RATE,METADATA$ACTION,METADATA$ISUPDATE,METADATA$ROW_ID
0,50,4609,"{'epoch': 1665058732, 'fraction': 0}",519,24850.436,47.881380,40.897881,37.104046,111.263969,INSERT,False,84caf69c94c0a32bc51c3f0ec78a2074bf5c4811
1,49,4608,"{'epoch': 1665058209, 'fraction': 0}",520,18181.857,34.965110,39.900000,52.311538,104.361538,INSERT,False,2fe1e68fe1479ada14fa27202a9632e84901d6cd
2,47,4608,"{'epoch': 1665057197, 'fraction': 0}",517,20884.968,40.396456,40.015474,41.827853,114.294004,INSERT,False,17d703d74565e9c741bce3bf0b8b46e0fc630060
3,48,4608,"{'epoch': 1665057717, 'fraction': 0}",490,22375.036,45.663339,40.579592,49.783673,107.720408,INSERT,False,0c4a6f1ad74772ba94a4aac6b5b6819c52e947bf

In [24]:
query = """
    SELECT user_id
        FROM users
"""

cs.execute(query).fetch_pandas_all()

   USER_ID
0     4603
1     4604
2     4607
3     4608
4     4609

In [25]:
query = """
    SELECT user_id
        FROM rides_stream
"""

cs.execute(query).fetch_pandas_all()

  USER_ID
0    4609
1    4608
2    4608
3    4609
4    4608

In [29]:
query = """
    SELECT users.user_id, rides_stream.ride_id
        FROM users
        RIGHT JOIN rides_stream
        ON users.user_id = rides_stream.user_id
"""

cs.execute(query).fetch_pandas_all()

   USER_ID RIDE_ID
0     4608      49
1     4608      48
2     4608      47
3     4609      51
4     4609      50